---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.ForwardIterator
source: html/58615f4e-e18e-7c01-9047-71d76f052e35.htm
---
# Autodesk.Revit.DB.CategorySet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CategorySetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.